int/resources/objectRepo/xmlTemplates/opera/FrontDeskOperations/req_AutoAssignRoom.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:v9="http://micros/opera/ws/fof/v9_00" xmlns:v91="http://micros/opera/ws/common/v9_00">
   <soapenv:Header/>
   <soapenv:Body>
      <v9:AutoAssignRoomRQ CorrelationID="?" EchoToken="?" Enforce="?" RequestCount="?" TimeStamp="?" Version="?">
         <v91:OperaContext>
            <v91:UserLanguage/>
            <v91:CROCode/>
            <v91:HotelCode/>
            <v91:Language/>
            <v91:RunningApplication/>
            <v91:TerminalId/>
            <v91:LogLevel/>
            <v91:ExternalSystem/>
            <v91:Override/>
            <v91:TargetExternalSystem/>
            <v91:UseLocal/>
            <v91:ExternalData/>
         </v91:OperaContext>
         <v9:Criteria>
            <v91:ReservationCriteria>
               <v91:ReservationIDList>
                  <v91:UniqueID ID="?" IDExtension="?" ID_Context="?" Instance="?" Type="?" URL="?"/>
               </v91:ReservationIDList>
            </v91:ReservationCriteria>
            <v91:RoomSelectionCriteria IncludeDepartureRooms="?" RoomNumberWildcard="?" UseAssociatedProfilePreferences="?">
               <v91:HotelCode/>
               <v91:RoomStatusFilter>
                  <v91:HotelRoomStatusList>
                     <v91:HotelRoomStatus/>
                  <v91:HotelRoomStatus/></v91:HotelRoomStatusList>
                  <v91:HotelFORoomStatusList>
                     <v91:HotelFORoomStatus/>
                  </v91:HotelFORoomStatusList>
               </v91:RoomStatusFilter>
               <v91:RoomRange FromRoomNumber="?" ToRoomNumber="?"/>
               <v91:HotelRoomDateRange>
                  <v91:StartDate/>
                  <v91:EndDate/>
                  <v91:Duration/>
               </v91:HotelRoomDateRange>
               <v91:RoomTypes>
                  <v91:RoomType/>
               </v91:RoomTypes>
               <v91:RoomClass/>
               <v91:Floor/>
               <v91:IncludeDueOut/>
               <v91:DepartureTime/>
               <v91:RoomFeatures>
                  <v91:RoomFeature Code="?" Description="?" OrderSequence="?" Quantity="?"/>
               </v91:RoomFeatures>
               <v91:SmokingPreference/>
               <v91:IncludeAllRoomConditions/>
               <v91:IncludePseudoRooms/>
               <v91:IncludeOORoomCheck/>
               <v91:ConnectingRoomsOnly/>
               <v91:ReservationID ID="?" IDExtension="?" ID_Context="?" Instance="?" Type="?" URL="?"/>
               <v91:PseudoRoomsOnly/>
            </v91:RoomSelectionCriteria>
         </v9:Criteria>
      </v9:AutoAssignRoomRQ>
   </soapenv:Body>
</soapenv:Envelope>